Revit 2027 API
RoofComponents.GetCurveLoops Method
 The CurveLoops of roof slabs.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<CurveLoop> GetCurveLoops()
Public Function GetCurveLoops As IList(Of CurveLoop)
public:
IList<CurveLoop^>^ GetCurveLoops()
member GetCurveLoops : unit -> IList<CurveLoop>
Return Value
IList<CurveLoop>
 The CurveLoops.
See Also
Reference
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace